7767517
166 180
Input                    in0                      0 1 in0
BinaryOp                 mul_0                    1 1 in0 1 0=2 1=1 2=1.562500e-02
MemoryData               pnnx_fold_97             0 1 2 0=1 1=1 2=512
Deconvolution            deconv_15                1 1 1 3 0=512 1=4 11=4 12=1 13=1 14=0 18=0 19=0 2=1 3=1 4=0 5=0 6=4194304
BinaryOp                 add_1                    2 1 3 2 4 0=0
ReLU                     leakyrelu_16             1 1 4 5 0=2.000000e-01
Split                    splitncnn_0              1 2 5 6 7
UnaryOp                  pow_2                    1 1 6 8 0=4
Reduction                mean_36                  1 1 8 9 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_3                    1 1 9 10 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_4                   1 1 10 11 0=5
BinaryOp                 div_5                    2 1 7 11 12 0=3
BinaryOp                 mul_6                    1 1 12 13 0=2 1=1 2=2.083333e-02
MemoryData               pnnx_fold_122            0 1 14 0=1 1=1 2=512
Convolution              conv_1                   1 1 13 15 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2359296
BinaryOp                 add_7                    2 1 15 14 16 0=0
ReLU                     leakyrelu_17             1 1 16 17 0=2.000000e-01
Split                    splitncnn_1              1 2 17 18 19
UnaryOp                  pow_8                    1 1 18 20 0=4
Reduction                mean_37                  1 1 20 21 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_9                    1 1 21 22 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_10                  1 1 22 23 0=5
BinaryOp                 div_11                   2 1 19 23 24 0=3
Interp                   upsample_30              1 1 24 25 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 mul_12                   1 1 25 26 0=2 1=1 2=2.083333e-02
MemoryData               pnnx_fold_154            0 1 27 0=1 1=1 2=512
Convolution              conv_2                   1 1 26 28 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2359296
BinaryOp                 add_13                   2 1 28 27 29 0=0
ReLU                     leakyrelu_18             1 1 29 30 0=2.000000e-01
Split                    splitncnn_2              1 2 30 31 32
UnaryOp                  pow_14                   1 1 31 33 0=4
Reduction                mean_38                  1 1 33 34 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_15                   1 1 34 35 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_16                  1 1 35 36 0=5
BinaryOp                 div_17                   2 1 32 36 37 0=3
BinaryOp                 mul_18                   1 1 37 38 0=2 1=1 2=2.083333e-02
MemoryData               pnnx_fold_179            0 1 39 0=1 1=1 2=512
Convolution              conv_3                   1 1 38 40 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2359296
BinaryOp                 add_19                   2 1 40 39 41 0=0
ReLU                     leakyrelu_19             1 1 41 42 0=2.000000e-01
Split                    splitncnn_3              1 2 42 43 44
UnaryOp                  pow_20                   1 1 43 45 0=4
Reduction                mean_39                  1 1 45 46 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_21                   1 1 46 47 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_22                  1 1 47 48 0=5
BinaryOp                 div_23                   2 1 44 48 49 0=3
Interp                   upsample_31              1 1 49 50 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 mul_24                   1 1 50 51 0=2 1=1 2=2.083333e-02
MemoryData               pnnx_fold_211            0 1 52 0=1 1=1 2=512
Convolution              conv_4                   1 1 51 53 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2359296
BinaryOp                 add_25                   2 1 53 52 54 0=0
ReLU                     leakyrelu_20             1 1 54 55 0=2.000000e-01
Split                    splitncnn_4              1 2 55 56 57
UnaryOp                  pow_26                   1 1 56 58 0=4
Reduction                mean_40                  1 1 58 59 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_27                   1 1 59 60 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_28                  1 1 60 61 0=5
BinaryOp                 div_29                   2 1 57 61 62 0=3
BinaryOp                 mul_30                   1 1 62 63 0=2 1=1 2=2.083333e-02
MemoryData               pnnx_fold_236            0 1 64 0=1 1=1 2=512
Convolution              conv_5                   1 1 63 65 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2359296
BinaryOp                 add_31                   2 1 65 64 66 0=0
ReLU                     leakyrelu_21             1 1 66 67 0=2.000000e-01
Split                    splitncnn_5              1 2 67 68 69
UnaryOp                  pow_32                   1 1 68 70 0=4
Reduction                mean_41                  1 1 70 71 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_33                   1 1 71 72 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_34                  1 1 72 73 0=5
BinaryOp                 div_35                   2 1 69 73 74 0=3
Interp                   upsample_32              1 1 74 75 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 mul_36                   1 1 75 76 0=2 1=1 2=2.083333e-02
MemoryData               pnnx_fold_268            0 1 77 0=1 1=1 2=512
Convolution              conv_6                   1 1 76 78 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2359296
BinaryOp                 add_37                   2 1 78 77 79 0=0
ReLU                     leakyrelu_22             1 1 79 80 0=2.000000e-01
Split                    splitncnn_6              1 2 80 81 82
UnaryOp                  pow_38                   1 1 81 83 0=4
Reduction                mean_42                  1 1 83 84 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_39                   1 1 84 85 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_40                  1 1 85 86 0=5
BinaryOp                 div_41                   2 1 82 86 87 0=3
BinaryOp                 mul_42                   1 1 87 88 0=2 1=1 2=2.083333e-02
MemoryData               pnnx_fold_293            0 1 89 0=1 1=1 2=512
Convolution              conv_7                   1 1 88 90 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2359296
BinaryOp                 add_43                   2 1 90 89 91 0=0
ReLU                     leakyrelu_23             1 1 91 92 0=2.000000e-01
Split                    splitncnn_7              1 2 92 93 94
UnaryOp                  pow_44                   1 1 93 95 0=4
Reduction                mean_43                  1 1 95 96 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_45                   1 1 96 97 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_46                  1 1 97 98 0=5
BinaryOp                 div_47                   2 1 94 98 99 0=3
Interp                   upsample_33              1 1 99 100 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 mul_48                   1 1 100 101 0=2 1=1 2=2.083333e-02
MemoryData               pnnx_fold_325            0 1 102 0=1 1=1 2=256
Convolution              conv_8                   1 1 101 103 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1179648
BinaryOp                 add_49                   2 1 103 102 104 0=0
ReLU                     leakyrelu_24             1 1 104 105 0=2.000000e-01
Split                    splitncnn_8              1 2 105 106 107
UnaryOp                  pow_50                   1 1 106 108 0=4
Reduction                mean_44                  1 1 108 109 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_51                   1 1 109 110 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_52                  1 1 110 111 0=5
BinaryOp                 div_53                   2 1 107 111 112 0=3
BinaryOp                 mul_54                   1 1 112 113 0=2 1=1 2=2.946278e-02
MemoryData               pnnx_fold_350            0 1 114 0=1 1=1 2=256
Convolution              conv_9                   1 1 113 115 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=589824
BinaryOp                 add_55                   2 1 115 114 116 0=0
ReLU                     leakyrelu_25             1 1 116 117 0=2.000000e-01
Split                    splitncnn_9              1 2 117 118 119
UnaryOp                  pow_56                   1 1 118 120 0=4
Reduction                mean_45                  1 1 120 121 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_57                   1 1 121 122 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_58                  1 1 122 123 0=5
BinaryOp                 div_59                   2 1 119 123 124 0=3
Interp                   upsample_34              1 1 124 125 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 mul_60                   1 1 125 126 0=2 1=1 2=2.946278e-02
MemoryData               pnnx_fold_382            0 1 127 0=1 1=1 2=128
Convolution              conv_10                  1 1 126 128 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=294912
BinaryOp                 add_61                   2 1 128 127 129 0=0
ReLU                     leakyrelu_26             1 1 129 130 0=2.000000e-01
Split                    splitncnn_10             1 2 130 131 132
UnaryOp                  pow_62                   1 1 131 133 0=4
Reduction                mean_46                  1 1 133 134 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_63                   1 1 134 135 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_64                  1 1 135 136 0=5
BinaryOp                 div_65                   2 1 132 136 137 0=3
BinaryOp                 mul_66                   1 1 137 138 0=2 1=1 2=4.166667e-02
MemoryData               pnnx_fold_407            0 1 139 0=1 1=1 2=128
Convolution              conv_11                  1 1 138 140 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=147456
BinaryOp                 add_67                   2 1 140 139 141 0=0
ReLU                     leakyrelu_27             1 1 141 142 0=2.000000e-01
Split                    splitncnn_11             1 2 142 143 144
UnaryOp                  pow_68                   1 1 143 145 0=4
Reduction                mean_47                  1 1 145 146 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_69                   1 1 146 147 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_70                  1 1 147 148 0=5
BinaryOp                 div_71                   2 1 144 148 149 0=3
Interp                   upsample_35              1 1 149 150 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 mul_72                   1 1 150 151 0=2 1=1 2=4.166667e-02
MemoryData               pnnx_fold_439            0 1 152 0=1 1=1 2=64
Convolution              conv_12                  1 1 151 153 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=73728
BinaryOp                 add_73                   2 1 153 152 154 0=0
ReLU                     leakyrelu_28             1 1 154 155 0=2.000000e-01
Split                    splitncnn_12             1 2 155 156 157
UnaryOp                  pow_74                   1 1 156 158 0=4
Reduction                mean_48                  1 1 158 159 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_75                   1 1 159 160 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_76                  1 1 160 161 0=5
BinaryOp                 div_77                   2 1 157 161 162 0=3
BinaryOp                 mul_78                   1 1 162 163 0=2 1=1 2=5.892557e-02
MemoryData               pnnx_fold_464            0 1 164 0=1 1=1 2=64
Convolution              conv_13                  1 1 163 165 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=36864
BinaryOp                 add_79                   2 1 165 164 166 0=0
ReLU                     leakyrelu_29             1 1 166 167 0=2.000000e-01
Split                    splitncnn_13             1 2 167 168 169
UnaryOp                  pow_80                   1 1 168 170 0=4
Reduction                mean_49                  1 1 170 171 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp                 add_81                   1 1 171 172 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_82                  1 1 172 173 0=5
BinaryOp                 div_83                   2 1 169 173 174 0=3
BinaryOp                 mul_84                   1 1 174 175 0=2 1=1 2=1.767767e-01
MemoryData               pnnx_fold_489            0 1 176 0=1 1=1 2=3
Convolution              conv_14                  1 1 175 177 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=192
BinaryOp                 add_85                   2 1 177 176 178 0=0
TanH                     tanh_0                   1 1 178 out0
